[
  {
    "country": "japan",
    "type": "funfact",
    "contents": [
      {
        "title": "Cherry Blossom Forecast",
        "content": "During the Hanami (Cherry Blossom) season, the obsession with the 'perfect bloom' is so intense that the Japan Meteorological Agency provides a highly detailed 'Cherry Blossom Forecast' (Sakura Zensen). This forecast tracks the 'cherry blossom front' as it moves from Okinawa in the south to Hokkaido in the north, and it is reported daily on the news like a weather report. They also have specific doctors (arborists) to take care of the trees.",
        "date_created": "2025-12-22T18:30:00Z",
        "date_updated": "2025-12-22T18:30:00Z",
        "reactions": []
      },
      {
        "title": "Osechi Ryori Layers",
        "content": "In Osechi Ryori (New Year food), the layers of the jubako (lacquered box) are not just for show. The top tier is for 'celebratory snacks' (like black beans) to drink with sake, while the bottom tier is traditionally left empty. This is to symbolize that there is still 'space' for more good fortune to enter the family's life in the coming year.",
        "date_created": "2025-12-22T18:30:00Z",
        "date_updated": "2025-12-22T18:30:00Z",
        "reactions": []
      },
      {
        "title": "Vending Machine Density",
        "content": "Japan has one of the highest densities of vending machines in the world, with approximately 1 machine for every 40 people (over 2.6 million total). You can buy almost anything from them, including hot coffee, umbrellas, ties, and even fresh soup stock.",
        "date_created": "2025-12-22T18:30:00Z",
        "date_updated": "2025-12-22T18:30:00Z",
        "reactions": []
      },
      {
        "title": "Inemuri (Sleeping on the Job)",
        "content": "Sleeping on the job, known as 'Inemuri', is socially accepted and often viewed as a sign of diligence—proof that you are working yourself to exhaustion. It literally translates to 'being present while sleeping.'",
        "date_created": "2025-12-22T18:30:00Z",
        "date_updated": "2025-12-22T18:30:00Z",
        "reactions": []
      }
    ]
  },
  {
    "country": "indonesia",
    "type": "funfact",
    "contents": [
      {
        "title": "Rendang Preservation",
        "content": "Rendang, the famous beef dish, was originally created by the Minangkabau people as a way to preserve meat for long journeys. Because it is slow-cooked until all liquid evaporates and the spices act as preservatives, authentic dry Rendang can last for up to three weeks at room temperature without spoiling.",
        "date_created": "2025-12-22T18:30:00Z",
        "date_updated": "2025-12-22T18:30:00Z",
        "reactions": []
      },
      {
        "title": "Silent Airport (Nyepi)",
        "content": "During Nyepi (Day of Silence) in Bali, the silence is so strictly enforced that even the airport (Ngurah Rai International Airport) shuts down for 24 hours. It is the only airport in the world that closes annually for a religious holiday. The only exceptions allowed on the streets are emergency vehicles.",
        "date_created": "2025-12-22T18:30:00Z",
        "date_updated": "2025-12-22T18:30:00Z",
        "reactions": []
      },
      {
        "title": "Komodo Dragons",
        "content": "Indonesia is the only place in the world where you can see Komodo Dragons in the wild (in the Komodo National Park). These are the world's largest lizards, capable of growing up to 3 meters (10 feet) long and weighing over 70 kg.",
        "date_created": "2025-12-22T18:30:00Z",
        "date_updated": "2025-12-22T18:30:00Z",
        "reactions": []
      },
      {
        "title": "Rafflesia Arnoldii",
        "content": "Indonesia is one of the places home to the Rafflesia Arnoldii, the flower with the world's largest bloom. It can grow up to 1 meter in diameter and weighs up to 11 kg. It is often called the 'corpse flower' because it smells like rotting meat to attract flies.",
        "date_created": "2025-12-22T18:30:00Z",
        "date_updated": "2025-12-22T18:30:00Z",
        "reactions": []
      }
    ]
  },
  {
    "country": "malaysia",
    "type": "funfact",
    "contents": [
      {
        "title": "Yee Sang Toss Ritual",
        "content": "For the Yee Sang (raw fish salad) toss during Chinese New Year, there is a specific order to adding the ingredients, and each step comes with a specific 'lucky phrase' (Chengyu). For example, when adding the oil, you say 'Cai Yuan Guang Jin' (May wealth pour in from all directions). The higher you toss the salad with your chopsticks, the higher your 'status' and luck will rise in the new year.",
        "date_created": "2025-12-22T18:30:00Z",
        "date_updated": "2025-12-22T18:30:00Z",
        "reactions": []
      },
      {
        "title": "Nasi Lemak Fashion",
        "content": "Nasi Lemak is so beloved that Malaysians have turned it into everything from ice cream and cheesecake to 'Nasi Lemak Miss Universe dresses.' In 2017, Miss Universe Malaysia wore a dress designed to look like a Nasi Lemak package, complete with beaded 'rice,' 'sambal,' and 'cucumber' wings.",
        "date_created": "2025-12-22T18:30:00Z",
        "date_updated": "2025-12-22T18:30:00Z",
        "reactions": []
      },
      {
        "title": "Sarawak Chamber",
        "content": "The Sarawak Chamber in Gunung Mulu National Park is the largest known cave chamber in the world by area. It is so massive that it could theoretically house 40 Boeing 747 aircrafts without their wings touching.",
        "date_created": "2025-12-22T18:30:00Z",
        "date_updated": "2025-12-22T18:30:00Z",
        "reactions": []
      },
      {
        "title": "Taman Negara Age",
        "content": "Taman Negara is one of the oldest rainforests in the world, estimated to be 130 million years old. It is older than the Amazon rainforest and the Congo basin, having remained largely undisturbed by ice ages.",
        "date_created": "2025-12-22T18:30:00Z",
        "date_updated": "2025-12-22T18:30:00Z",
        "reactions": []
      }
    ]
  },
  {
    "country": "south_korea",
    "type": "funfact",
    "contents": [
      {
        "title": "Kimchi Premium",
        "content": "There is a 'Kimchi Premium' in Korea (similar to the Big Mac Index). Because Kimchi is so essential to daily life, the government monitors the price of napa cabbage and radishes closely. During 'Kimchi Crisis' years (due to typhoons or drought), the government has even used military transport planes to airlift cabbage from Jeju Island to the mainland to stabilize prices.",
        "date_created": "2025-12-22T18:30:00Z",
        "date_updated": "2025-12-22T18:30:00Z",
        "reactions": []
      },
      {
        "title": "Ear-Sharpening Wine",
        "content": "On Daeboreum (First Full Moon), people drink 'Ear-Sharpening Wine' (Gwibalki-sul). It is believed that drinking this cold sake in the morning will sharpen your hearing so you can hear 'good news' all year round.",
        "date_created": "2025-12-22T18:30:00Z",
        "date_updated": "2025-12-22T18:30:00Z",
        "reactions": []
      },
      {
        "title": "Plastic Surgery Capital",
        "content": "South Korea is often called the 'Plastic Surgery Capital of the World,' having the highest rate of cosmetic surgeries per capita globally. It is estimated that one in five Korean women has undergone some form of cosmetic procedure.",
        "date_created": "2025-12-22T18:30:00Z",
        "date_updated": "2025-12-22T18:30:00Z",
        "reactions": []
      },
      {
        "title": "Common Surnames",
        "content": "Approximately half of the entire South Korean population shares just three surnames: Kim, Lee, and Park. 'Kim' is the most common, held by about 20% of the population.",
        "date_created": "2025-12-22T18:30:00Z",
        "date_updated": "2025-12-22T18:30:00Z",
        "reactions": []
      }
    ]
  },
  {
    "country": "thailand",
    "type": "funfact",
    "contents": [
      {
        "title": "Monkey Buffet Festival",
        "content": "The Monkey Buffet Festival is exactly what it sounds like. It is not a festival for humans, but for the thousands of long-tailed macaques living in Lopburi. Locals set up massive banquet tables with tons of fruit, vegetables, and sticky rice to thank the monkeys for bringing tourism to the town. It is one of the strangest festivals in the world.",
        "date_created": "2025-12-22T18:30:00Z",
        "date_updated": "2025-12-22T18:30:00Z",
        "reactions": []
      },
      {
        "title": "Pad Thai Origins",
        "content": "Pad Thai was established as Thailand's national dish in the late 1930s by Prime Minister Phibun to foster national unity and prevent colonization by creating a distinct cultural identity. Despite its iconic Thai status, the dish actually has Chinese origins. It is celebrated for masterfully balancing five distinct flavors—spicy, salty, sweet, sour, and bitter—in a single dish.",
        "date_created": "2025-12-22T18:30:00Z",
        "date_updated": "2025-12-22T18:30:00Z",
        "reactions": []
      },
      {
        "title": "Longest Place Name (Bangkok)",
        "content": "Bangkok holds the Guinness World Record for the longest place name. While foreigners say 'Bangkok,' the official Thai name is: Krung Thep Mahanakhon Amon Rattanakosin Mahinthara Ayuthaya Mahadilok Phop Noppharat Ratchathani Burirom Udomratchaniwet Mahasathan Amon Piman Awatan Sathit Sakkathattiya Witsanukam Prasit.",
        "date_created": "2025-12-22T18:30:00Z",
        "date_updated": "2025-12-22T18:30:00Z",
        "reactions": []
      },
      {
        "title": "Never Colonized",
        "content": "Thailand is the only country in Southeast Asia that was never colonized by a European power. It served as a 'buffer state' between British Burma and French Indochina, a feat credited to the diplomatic skills of its monarchs (King Rama IV and V).",
        "date_created": "2025-12-22T18:30:00Z",
        "date_updated": "2025-12-22T18:30:00Z",
        "reactions": []
      }
    ]
  }
]